Show / Hide Table of Contents
Class NonConformityIssue
Non-conformity issue
Inheritance
System.Object
NonConformityIssue
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Message
Assembly: IdeaRS.OpenModel.dll
Syntax
public class NonConformityIssue
Constructors
Improve this Doc   View Source
NonConformityIssue()
Constructor
Declaration
public NonConformityIssue()
Properties
Improve this Doc   View Source
Description
Description of the nonconformity
Declaration
public string Description { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Guid
Description of the nonconformity
Declaration
public Guid Guid { get; set; }
Property Value
 Type |  Description
 System.Guid
Improve this Doc   View Source
Severity
severity of this nonconformity
Declaration
public NonConformitySeverity Severity { get; set; }
Property Value
 Type |  Description
 NonConformitySeverity
 Improve this Doc
 View Source